tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf6525_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF6525_H_
#define _PIC18LF6525_H_

#define ECCP2DEL                      0
#define P2DC0                         1
#define P2DC                          2
#define ECCP2DEL_PDC0                 3
#define P2DC1                         4
#define ECCP2DEL_PDC1                 5
#define P2DC2                         6
#define ECCP2DEL_PDC2                 7
#define P2DC3                         8
#define ECCP2DEL_PDC3                 9
#define P2DC4                         10
#define ECCP2DEL_PDC4                 11
#define P2DC5                         12
#define ECCP2DEL_PDC5                 13
#define P2DC6                         14
#define ECCP2DEL_PDC6                 15
#define ECCP2DEL_PRSEN                16
#define P2RSEN                        17
#define PSS2BD                        18
#define PSS2BD0                       19
#define ECCP2AS_PSSBD0                20
#define PSS2BD1                       21
#define ECCP2AS_PSSBD1                22
#define PSS2AC0                       23
#define ECCP2AS_PSSAC0                24
#define PSS2AC                        25
#define PSS2AC1                       26
#define ECCP2AS_PSSAC1                27
#define ECCP2AS0                      28
#define ECCP2AS                       29
#define ECCP2AS1                      30
#define ECCP2AS2                      31
#define ECCP2ASE                      32
#define ECCP3DEL                      33
#define ECCP3DEL_PDC0                 34
#define P3DC0                         35
#define P3DC                          36
#define ECCP3DEL_PDC1                 37
#define P3DC1                         38
#define ECCP3DEL_PDC2                 39
#define P3DC2                         40
#define ECCP3DEL_PDC3                 41
#define P3DC3                         42
#define ECCP3DEL_PDC4                 43
#define P3DC4                         44
#define ECCP3DEL_PDC5                 45
#define P3DC5                         46
#define ECCP3DEL_PDC6                 47
#define P3DC6                         48
#define P3RSEN                        49
#define ECCP3DEL_PRSEN                50
#define PSS3BD0                       51
#define ECCP3AS_PSSBD0                52
#define PSS3BD                        53
#define PSS3BD1                       54
#define ECCP3AS_PSSBD1                55
#define PSS3AC0                       56
#define ECCP3AS_PSSAC0                57
#define PSS3AC                        58
#define ECCP3AS_PSSAC1                59
#define PSS3AC1                       60
#define ECCP3AS                       61
#define ECCP3AS0                      62
#define ECCP3AS1                      63
#define ECCP3AS2                      64
#define ECCP3ASE                      65
#define RCSTA2                        66
#define RCD82                         67
#define RX9D2                         68
#define RCSTA2_RX9D                   69
#define RCSTA2_OERR                   70
#define OERR2                         71
#define FERR2                         72
#define RCSTA2_FERR                   73
#define ADEN2                         74
#define RCSTA2_ADEN                   75
#define ADDEN2                        76
#define RCSTA2_ADDEN                  77
#define RCSTA2_CREN                   78
#define CREN2                         79
#define SREN2                         80
#define RCSTA2_SREN                   81
#define RC92                          82
#define RC8_92                        83
#define RCSTA2_RX9                    84
#define RX92                          85
#define RCSTA2_SPEN                   86
#define SPEN2                         87
#define TXSTA2                        88
#define TX9D2                         89
#define TXSTA2_TX9D                   90
#define TXD82                         91
#define TRMT2                         92
#define TXSTA2_TRMT                   93
#define BRGH2                         94
#define TXSTA2_BRGH                   95
#define SENDB2                        96
#define TXSTA2_SENDB                  97
#define TXSTA2_SYNC                   98
#define SYNC2                         99
#define TXEN2                         100
#define TXSTA2_TXEN                   101
#define TX8_92                        102
#define TX92                          103
#define TXSTA2_TX9                    104
#define TXSTA2_CSRC                   105
#define CSRC2                         106
#define CCP5CON                       107
#define CCP5M0                        108
#define CCP5M                         109
#define CCP5M1                        110
#define CCP5M2                        111
#define CCP5M3                        112
#define CCP5Y                         113
#define DC5B0                         114
#define DC5B                          115
#define CCP5X                         116
#define DC5B1                         117
#define CCP4CON                       118
#define CCP4M                         119
#define CCP4M0                        120
#define CCP4M1                        121
#define CCP4M2                        122
#define CCP4M3                        123
#define CCP4Y                         124
#define DC4B0                         125
#define DC4B                          126
#define CCP4X                         127
#define DC4B1                         128
#define T4CON                         129
#define T4CKPS0                       130
#define T4CKPS                        131
#define T4CKPS1                       132
#define TMR4ON                        133
#define T4OUTPS                       134
#define TOUTPS0                       135
#define T4OUTPS0                      136
#define T4OUTPS1                      137
#define TOUTPS1                       138
#define TOUTPS2                       139
#define T4OUTPS2                      140
#define TOUTPS3                       141
#define T4OUTPS3                      142
#define ECCP1DEL                      143
#define P1DC0                         144
#define ECCP1DEL_PDC0                 145
#define P1DC                          146
#define P1DC1                         147
#define ECCP1DEL_PDC1                 148
#define P1DC2                         149
#define ECCP1DEL_PDC2                 150
#define P1DC3                         151
#define ECCP1DEL_PDC3                 152
#define P1DC4                         153
#define ECCP1DEL_PDC4                 154
#define P1DC5                         155
#define ECCP1DEL_PDC5                 156
#define P1DC6                         157
#define ECCP1DEL_PDC6                 158
#define P1RSEN                        159
#define P1DC7                         160
#define ECCP1DEL_PRSEN                161
#define BAUDCON2                      162
#define ABDEN2                        163
#define BAUDCON2_ABDEN                164
#define WUE2                          165
#define BAUDCON2_WUE                  166
#define BRG162                        167
#define BAUDCON2_BRG16                168
#define SCKP2                         169
#define BAUDCON2_SCKP                 170
#define TXCKP2                        171
#define BAUDCON2_RCMT                 172
#define BAUDCON2_RCIDL                173
#define RCMT2                         174
#define RCIDL2                        175
#define BAUDCON1                      176
#define ABDEN1                        177
#define BAUDCON1_ABDEN                178
#define BAUDCON1_WUE                  179
#define WUE1                          180
#define W4E                           181
#define BAUDCON1_BRG16                182
#define BRG161                        183
#define TXCKP                         184
#define SCKP1                         185
#define TXCKP1                        186
#define BAUDCON1_SCKP                 187
#define CKTXP                         188
#define BAUDCON1_RCIDL                189
#define BAUDCON1_RCMT                 190
#define RCIDL1                        191
#define RCMT1                         192
#define PORTA                         193
#define AN0                           194
#define PORTA_RA0                     195
#define ULPWUIN                       196
#define AN1                           197
#define PORTA_RA1                     198
#define AN2                           199
#define PORTA_RA2                     200
#define VREFM                         201
#define AN3                           202
#define PORTA_RA3                     203
#define VREFP                         204
#define PORTA_RA4                     205
#define T0CKI                         206
#define AN4                           207
#define PORTA_RA5                     208
#define LVDIN                         209
#define CLKO                          210
#define PORTA_RA6                     211
#define OSC2                          212
#define PORTB                         213
#define INT0                          214
#define PORTB_RB0                     215
#define INT1                          216
#define PORTB_RB1                     217
#define INT2                          218
#define PORTB_RB2                     219
#define INT3                          220
#define CCP2_PA2                      221
#define PORTB_RB3                     222
#define RB4                           223
#define KBI0                          224
#define PGM                           225
#define KBI1                          226
#define PORTB_RB5                     227
#define PGC                           228
#define KBI2                          229
#define PORTB_RB6                     230
#define PGD                           231
#define KBI3                          232
#define PORTB_RB7                     233
#define PORTC                         234
#define T13CKI                        235
#define T1OSO                         236
#define PORTC_RC0                     237
#define CCP2                          238
#define T1OSI                         239
#define PORTC_RC1                     240
#define PA2                           241
#define CCP1                          242
#define P1A                           243
#define PA1                           244
#define PORTC_RC2                     245
#define SCL                           246
#define SCK                           247
#define PORTC_RC3                     248
#define SDA                           249
#define SDI                           250
#define PORTC_RC4                     251
#define SDO                           252
#define PORTC_RC5                     253
#define PORTC_RC6                     254
#define TX1                           255
#define CK1                           256
#define RX1                           257
#define DT1                           258
#define PORTC_RC7                     259
#define PORTD                         260
#define PORTD_RD0                     261
#define PSP0                          262
#define PORTD_RD1                     263
#define PSP1                          264
#define PORTD_RD2                     265
#define PSP2                          266
#define PORTD_RD3                     267
#define PSP3                          268
#define PORTD_RD4                     269
#define PSP4                          270
#define PORTD_RD5                     271
#define PSP5                          272
#define PORTD_RD6                     273
#define PSP6                          274
#define PORTD_RD7                     275
#define SS2                           276
#define PSP7                          277
#define PORTE                         278
#define P2D                           279
#define PORTE_RD                      280
#define PD2                           281
#define RDE                           282
#define PORTE_RE0                     283
#define P2C                           284
#define PORTE_WR                      285
#define WRE                           286
#define PORTE_RE1                     287
#define PC2                           288
#define P2B                           289
#define CCP10                         290
#define PB2                           291
#define CS                            292
#define PORTE_RE2                     293
#define CCP9E                         294
#define P3C                           295
#define PORTE_RE3                     296
#define PC3E                          297
#define PB3E                          298
#define P3B                           299
#define PORTE_RE4                     300
#define CCP8E                         301
#define P1C                           302
#define CCP7E                         303
#define PORTE_RE5                     304
#define PC1E                          305
#define CCP6E                         306
#define P1B                           307
#define PORTE_RE6                     308
#define PB1E                          309
#define CCP2E                         310
#define PORTE_RE7                     311
#define PA2E                          312
#define PORTF                         313
#define PORTF_RF0                     314
#define AN5                           315
#define PORTF_RF1                     316
#define C2OUTF                        317
#define AN6                           318
#define PORTF_RF2                     319
#define AN7                           320
#define C1OUTF                        321
#define PORTF_RF3                     322
#define AN8                           323
#define PORTF_RF4                     324
#define AN9                           325
#define PORTF_RF5                     326
#define AN10                          327
#define CVREFF                        328
#define PORTF_RF6                     329
#define AN11                          330
#define PORTF_RF7                     331
#define SS                            332
#define PORTG                         333
#define CCP3                          334
#define P3A                           335
#define PORTG_RG0                     336
#define C3OUTG                        337
#define TX2                           338
#define PORTG_RG1                     339
#define CK2                           340
#define RX2                           341
#define PORTG_RG2                     342
#define DT2                           343
#define CCP4                          344
#define P3D                           345
#define PORTG_RG3                     346
#define CCP5                          347
#define PORTG_RG4                     348
#define P1D                           349
#define VPP                           350
#define RG5                           351
#define MCLR                          352
#define RJPU                          353
#define LATA                          354
#define LATA0                         355
#define LA0                           356
#define LATA1                         357
#define LA1                           358
#define LATA2                         359
#define LA2                           360
#define LATA3                         361
#define LA3                           362
#define LATA4                         363
#define LA4                           364
#define LATA5                         365
#define LA5                           366
#define LATA6                         367
#define LA6                           368
#define LATB                          369
#define LB0                           370
#define LATB0                         371
#define LB1                           372
#define LATB1                         373
#define LB2                           374
#define LATB2                         375
#define LB3                           376
#define LATB3                         377
#define LB4                           378
#define LATB4                         379
#define LB5                           380
#define LATB5                         381
#define LB6                           382
#define LATB6                         383
#define LB7                           384
#define LATB7                         385
#define LATC                          386
#define LATC0                         387
#define LC0                           388
#define LATC1                         389
#define LC1                           390
#define LATC2                         391
#define LC2                           392
#define LATC3                         393
#define LC3                           394
#define LATC4                         395
#define LC4                           396
#define LATC5                         397
#define LC5                           398
#define LATC6                         399
#define LC6                           400
#define LATC7                         401
#define LC7                           402
#define LATD                          403
#define LATD0                         404
#define LD0                           405
#define LATD1                         406
#define LD1                           407
#define LATD2                         408
#define LD2                           409
#define LATD3                         410
#define LD3                           411
#define LATD4                         412
#define LD4                           413
#define LATD5                         414
#define LD5                           415
#define LATD6                         416
#define LD6                           417
#define LATD7                         418
#define LD7                           419
#define LATE                          420
#define LATE0                         421
#define LE0                           422
#define LATE1                         423
#define LE1                           424
#define LATE2                         425
#define LE2                           426
#define LATE3                         427
#define LE3                           428
#define LATE4                         429
#define LE4                           430
#define LATE5                         431
#define LE5                           432
#define LATE6                         433
#define LE6                           434
#define LATE7                         435
#define LE7                           436
#define LATF                          437
#define LATF0                         438
#define LF0                           439
#define LATF1                         440
#define LF1                           441
#define LF2                           442
#define LATF2                         443
#define LF3                           444
#define LATF3                         445
#define LF4                           446
#define LATF4                         447
#define LF5                           448
#define LATF5                         449
#define LF6                           450
#define LATF6                         451
#define LF7                           452
#define LATF7                         453
#define LATG                          454
#define LATG0                         455
#define LG0                           456
#define LATG1                         457
#define LG1                           458
#define LATG2                         459
#define LG2                           460
#define LATG3                         461
#define LG3                           462
#define LATG4                         463
#define LG4                           464
#define TRISA                         465
#define TRISA_RA0                     466
#define TRISA0                        467
#define TRISA_RA1                     468
#define TRISA1                        469
#define TRISA2                        470
#define TRISA_RA2                     471
#define TRISA_RA3                     472
#define TRISA3                        473
#define TRISA_RA4                     474
#define TRISA4                        475
#define TRISA_RA5                     476
#define TRISA5                        477
#define TRISA_RA6                     478
#define TRISA6                        479
#define TRISB                         480
#define TRISB_RB0                     481
#define TRISB0                        482
#define TRISB_RB1                     483
#define TRISB1                        484
#define TRISB_RB2                     485
#define TRISB2                        486
#define TRISB_RB3                     487
#define TRISB3                        488
#define RB4                           489
#define TRISB4                        490
#define TRISB_RB5                     491
#define TRISB5                        492
#define TRISB_RB6                     493
#define TRISB6                        494
#define TRISB_RB7                     495
#define TRISB7                        496
#define TRISC                         497
#define TRISC0                        498
#define TRISC_RC0                     499
#define TRISC1                        500
#define TRISC_RC1                     501
#define TRISC2                        502
#define TRISC_RC2                     503
#define TRISC3                        504
#define TRISC_RC3                     505
#define TRISC4                        506
#define TRISC_RC4                     507
#define TRISC5                        508
#define TRISC_RC5                     509
#define TRISC6                        510
#define TRISC_RC6                     511
#define TRISC7                        512
#define TRISC_RC7                     513
#define TRISD                         514
#define TRISD_RD0                     515
#define TRISD0                        516
#define TRISD_RD1                     517
#define TRISD1                        518
#define TRISD_RD2                     519
#define TRISD2                        520
#define TRISD_RD3                     521
